i486/porteus/base/001-core/usr/man/man8/lvmconf.8
.TH "LVMCONF" "8" "LVM TOOLS 2.02.100(2) (2013-08-13)" "Red Hat, Inc" "\""

.SH "NAME"
.B lvmconf
\- LVM configuration modifier

.SH "SYNOPSIS"
.B lvmconf
.RB [ \-\-disable-cluster ]
.RB [ \-\-enable-cluster ]
.RB [ \-\-file
.RI < configfile >]
.RB [ \-\-lockinglib
.RI < lib >]
.RB [ \-\-lockinglibdir
.RI < dir >]

.SH "DESCRIPTION"
lvmconf is a script that modifies the locking configuration in
an lvm configuration file. See \fBlvm.conf\fP(5).

.SH "OPTIONS"
.TP
.BR \-\-disable-cluster
Set \fBlocking_type\fR to the default non-clustered type.
.TP
.BR \-\-enable-cluster
Set \fBlocking_type\fR to the default clustered type on this system.
.TP
.BR \-\-file " <" \fIconfigfile >
Apply the changes to \fIconfigfile\fP instead of the default
\fI/etc/lvm/lvm.conf\fP.
.TP
.BR \-\-lockinglib " <" \fIlib >
Set external \fBlocking_library\fR locking library to load if an external locking type is used.
.TP
.BR \-\-lockinglibdir " <" \fIdir >
.SH FILES
.I /etc/lvm/lvm.conf

.SH "SEE ALSO"
.BR lvm (8),
.BR lvm.conf (5)
